Repository: parasc2021/edx_gea
Catalog: edx_gea/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Assessment file
fr: Fichier d'évaluation

source: External Activity Grader
fr: Noteur d'activité externe

source: Line %(line)s: %(error_description)s
fr: Ligne %(line)s : %(error_description)s

source: Score %s is not a valid number.
fr: La note %s n'est pas un nombre valide.

source: Score %s is not an integer.
fr: La note %s n'est pas un entier.

source: Score %s is outside score limits.
fr: Le score %s est en dehors du barème.

source: Unsupported file extension.
fr: Extension du fichier incorrecte

source: CSV delimiter
fr: Délimiteur CSV

source: Semicolon
fr: Point-virgule

source: Comma
fr: Virgule

source: Thank you, the students assessment has been done.
fr: Merci, les évaluations des apprenants ont bien été prises en compte.

source: The csv file has more than %s lines.
fr: Le fichier csv dépasse les %s lignes.

source: User %s does not exist.
fr: L'utilisateur %s n'existe pas.

source: User %s is not enrolled in this course.
fr: L'utilisateur %s n'est pas inscrit à ce cours.

source: Student needs a score to be graded.
fr: L'apprenant a besoin d'une note pour être noter.

source: The assessment file contains errors, please fix them, and upload the file again.
fr: Le fichier d'évaluation contient des erreurs, veuillez les corriger et envoyer le fichier de nouveau.

source: Please wait a few minutes, file is being uploaded.
fr: Veuillez patienter quelques minutes, le fichier est en cours d'envoi.

source: The csv file sould not exceed %(max_assessment_file_lines)s lines.
fr: Le fichier csv ne doit pas dépasser %(max_assessment_file_lines)s lignes.

# gea
source: Grade
fr: Noter

source: If you have more than %(max_assessment_file_lines)s students to grade, upload the assessment file in smaller chunks.
fr: Si vous avez plus de %(max_assessment_file_lines)s apprenants à noter, veuillez envoyer le fichier de notation en plusieurs fois.

source: Grade:
fr: Note :

source: Comment:
fr: Commentaire :

source: Maximum grade
fr: Note maximale

source: Activity not graded yet.
fr: Cette activité n'a pas encore été notée.

source: Maximum grade of the external activity.
fr: Note maximale de l'activité externe.
